{"sections":{"main":{"type":"main-article","settings":{"show_tags":true,"show_author":true,"show_date":true,"featured_image_width":"page","heading_align":"text-center","show_share_buttons":true,"pagination":"bar-reading"}},"faq_X7eUiG":{"type":"faq","blocks":{"question_F7hbPc":{"type":"question","settings":{"icon":"none","heading":"What is a scroll sleigh bed frame?","text":"<p>A scroll sleigh bed frame is a type of bed frame that has a curved, scroll-like shape just like that of a sleigh. They are often associated with olden days or classic styles made from products such as<br\/>steel and lumber. Generally, these designs feature graceful contours and complicated particulars making them appear exquisite in any sleeping quarters.<\/p>"}},"question_hFQFK7":{"type":"question","settings":{"icon":"none","heading":"What materials are commonly used for scroll sleigh bed frames?","text":"<p>There exist numerous materials used in the making of scroll sleigh bed frames. People prefer to use hardwood (e.g. oak, walnut or pine), metal as well as upholstered alternatives. Wooden frames usually come with elaborate carvings or finishes whereas on the other hand, metal frameworks can be designed with decorative scroll work patterns. <\/p>"}},"question_YEyCEW":{"type":"question","settings":{"icon":"none","heading":"What size options are available for scroll sleigh bed frames in the UK?","text":"<p>Bed Frames Scroll Sleigh in the UK comes in a selection of standard dimensions: Single, Double, King and Super King. These are the most common sizes in any bedroom setting across the globe. Choosing a<br\/>size that will suit your room and meet all your comfort needs is crucial. It’s vital to ensure you know the bed frame measurements so that they match your mattress and fit well within the space available in your bedroom.<\/p>"}},"question_c4PrNW":{"type":"question","settings":{"icon":"none","heading":"How do I maintain and care for a scroll sleigh bed frame?","text":"<p>The bed frame’s material determines how it should be maintained. For wooden ones, for instance, they can be kept looking great through frequent dusting and occasional polishing. Metal bed frames should be cleaned with a wet rag and dried immediately so that there is no rusting. Spot cleaning and sometimes vacuuming may also be necessary on upholstered frames. <\/p>"}},"question_YCMdCD":{"type":"question","settings":{"icon":"none","heading":"Where can I buy a scroll sleigh bed frame in the UK?","text":"<p>Buy quality high-end <a href=\"https:\/\/www.bedroomking.co.uk\/collections\/sleigh-beds\" target=\"_blank\" title=\"https:\/\/www.bedroomking.co.uk\/collections\/sleigh-beds\">scroll sleigh bed frames<\/a> from the Bedroomking online store. We have a variety of styles and designs for every need.<\/p>"}}},"block_order":["question_F7hbPc","question_hFQFK7","question_YEyCEW","question_c4PrNW","question_YCMdCD"],"settings":{"heading":"Frequently Asked Questions","heading_align":"text-center","color_scheme":"1","full_width":true}},"article-comments":{"type":"article-comments","settings":{}}},"order":["main","faq_X7eUiG","article-comments"]}